espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_lesense.h
/** Default configuration for LESENSE_TimeCtrlDesc_TypeDef structure. */
#define LESENSE_TIMECTRL_DESC_DEFAULT              \
  {                                                \
    0U, /* No sensor interaction delay. */         \
    false /* Do not delay the AUXHFRCO startup. */ \
  }

/** LESENSE peripheral control descriptor structure. */
typedef struct {
  /** Configure DAC channel 0 data control. */
  LESENSE_ControlDACData_TypeDef dacCh0Data;

#if defined(_LESENSE_PERCTRL_DACCH0CONV_MASK)
  /** Configure how LESENSE controls conversion on DAC channel 0. */
  LESENSE_ControlDACConv_TypeDef dacCh0ConvMode;
#endif

#if defined(_LESENSE_PERCTRL_DACCH0OUT_MASK)
  /** Configure how LESENSE controls output on DAC channel 0. */
  LESENSE_ControlDACOut_TypeDef  dacCh0OutMode;
#endif

#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
  /** Configure DAC channel 1 data control. */
  LESENSE_ControlDACData_TypeDef dacCh1Data;
#endif

#if defined(_LESENSE_PERCTRL_DACCH1CONV_MASK)
  /** Configure how LESENSE controls conversion on DAC channel 1. */
  LESENSE_ControlDACConv_TypeDef dacCh1ConvMode;
#endif

#if defined(_LESENSE_PERCTRL_DACCH1OUT_MASK)
  /** Configure how LESENSE controls output on DAC channel 1. */
  LESENSE_ControlDACOut_TypeDef  dacCh1OutMode;
#endif

#if defined(_LESENSE_PERCTRL_DACPRESC_MASK)
  /** Configure the prescaling factor for the LESENSE - DAC interface.
   *  Valid range: 0-31 (5-bit). */
  uint8_t                        dacPresc;
#endif

#if defined(_LESENSE_PERCTRL_DACREF_MASK)
  /** Configure the DAC reference to be used. Set to #lesenseDACRefVdd to use
   *  VDD and set to #lesenseDACRefBandGap to use band gap as reference. */
  LESENSE_DACRef_TypeDef         dacRef;
#endif

  /** Configure how LESENSE controls ACMP 0. */
  LESENSE_ControlACMP_TypeDef    acmp0Mode;

  /** Configure how LESENSE controls ACMP 1. */
  LESENSE_ControlACMP_TypeDef    acmp1Mode;

#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
  /** Configure how LESENSE controls ACMPs and DAC in idle mode. */
  LESENSE_WarmupMode_TypeDef     warmupMode;
#endif

#if defined(_LESENSE_PERCTRL_DACCONVTRIG_MASK)
  /** When set to true the DAC is only enabled once for each scan. When
   *  set to false the DAC is enabled before every channel measurement. */
  bool                           dacScan;
#endif

#if defined(_LESENSE_PERCTRL_DACSTARTUP_MASK)
  /** When set to true the DAC is started a half clock cycle before sensor
  *  interaction starts. When set to false, a full clock cycle is used. */
  bool                           dacStartupHalf;
#endif

#if defined(_LESENSE_PERCTRL_DACCH0EN_MASK)
  /** When set to true, LESENSE controls DAC channel 0. */
  bool                           dacCh0En;
#endif

#if defined(_LESENSE_PERCTRL_DACCH1EN_MASK)
  /** When set to true, LESENSE controls DAC channel 1. */
  bool                           dacCh1En;
#endif
} LESENSE_PerCtrlDesc_TypeDef;

/** Default configuration for LESENSE_PerCtrl_TypeDef structure. */
#if defined(_SILICON_LABS_32B_SERIES_0)
#define LESENSE_PERCTRL_DESC_DEFAULT                                                                 \
  {                                                                                                  \
    lesenseDACIfData,         /* DAC channel 0 data is defined by DAC_CH0DATA register */            \
    lesenseDACConvModeDisable,/* LESENSE does not control DAC CH0. */                                \
    lesenseDACOutModeDisable, /* DAC channel 0 output to pin disabled. */                            \
    lesenseDACIfData,         /* DAC channel 1 data is defined by DAC_CH1DATA register */            \
    lesenseDACConvModeDisable,/* LESENSE does not control DAC CH1. */                                \
    lesenseDACOutModeDisable, /* DAC channel 1 output to pin disabled. */                            \
    0U,                       /* DAC prescaling factor of 1 (0+1). */                                \
    lesenseDACRefVdd,         /* DAC uses VDD reference. */                                          \
    lesenseACMPModeMuxThres,  /* LESENSE controls input mux and threshold value of ACMP0.         */ \
    lesenseACMPModeMuxThres,  /* LESENSE controls input mux and threshold value of ACMP1.         */ \
    lesenseWarmupModeKeepWarm /* Keep both ACMPs and DAC powered up when LESENSE is idle. */         \
  }
#elif defined(_SILICON_LABS_32B_SERIES_1)
#define LESENSE_PERCTRL_DESC_DEFAULT                                                                 \
  {                                                                                                  \
    lesenseDACIfData,         /* DAC channel 0 data is defined by DAC_CH0DATA register. */           \
    lesenseDACIfData,         /* DAC channel 1 data is defined by DAC_CH1DATA register. */           \
    lesenseACMPModeMuxThres,  /* LESENSE controls input mux and threshold value of ACMP0.         */ \
    lesenseACMPModeMuxThres,  /* LESENSE controls input mux and threshold value of ACMP1.         */ \
    lesenseWarmupModeKeepWarm,/* Keep both ACMPs and DAC powered up when LESENSE is idle.     */     \
    false,                    /* DAC is enabled for before every channel measurement. */             \
    false,                    /* DAC is enabled a full clock cycle before sensor interaction */      \
    false,                    /* LESENSE does not control DAC channel 0. */                          \
    false                     /* LESENSE does not control DAC channel 1. */                          \
  }
#else
#define LESENSE_PERCTRL_DESC_DEFAULT                                                                 \
  {                                                                                                  \
    lesenseDACIfData,         /* DAC channel 0 data is defined by DAC_CH0DATA register. */           \
    lesenseACMPModeMuxThres,  /* LESENSE controls input mux and threshold value of ACMP0.         */ \
    lesenseACMPModeMuxThres,  /* LESENSE controls input mux and threshold value of ACMP1.         */ \
    false,                    /* DAC is enabled for before every channel measurement. */             \
    false,                    /* DAC is enabled a full clock cycle before sensor interaction */      \
  }
#endif

/** LESENSE decoder control descriptor structure. */
typedef struct {
#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
  /** Select input to the LESENSE decoder. */
  LESENSE_DecInput_TypeDef decInput;

  /** Initial state of the LESENSE decoder. */
  uint32_t                 initState;
#endif

